# Autres fonctionnalités / nouveautés sur Pandas

## 1. Quand une colonne Pandas contient des listes

In [1]:
import pandas as pd

In [5]:
data = {
    "name": ['Rice', 'Cake', 'Beer'],
    "ingredients": [['Rice'], ['Flour', 'Water', 'Eggs'], ['Water', 'Hop']]
}

Si on intervient pas sur le dictionnaire ci-avant

In [6]:
df = pd.DataFrame(data)
df

   name           ingredients
0  Rice                [Rice]
1  Cake  [Flour, Water, Eggs]
2  Beer          [Water, Hop]

Et cette fois-ci si on utilise la fonction 'explode'

In [7]:
df = df.explode("ingredients")
df

   name ingredients
0  Rice        Rice
1  Cake       Flour
1  Cake       Water
1  Cake        Eggs
2  Beer       Water
2  Beer         Hop

## 2. Création d'une colonne catégorique

In [11]:
df_cut = pd.DataFrame({
    "Name": ['Marcus', 'Leia', 'Oscar', 'Dan', 'Judy', 'Tom', 'Emily'],
    "Score": [90, 95, 55, 62, 75, 98, 81]
    })
df_cut

     Name  Score
0  Marcus     90
1    Leia     95
2   Oscar     55
3     Dan     62
4    Judy     75
5     Tom     98
6   Emily     81

1ère solution : recourir aux conditions if / elif / else

In [7]:
# Nouvelle colonne
df_cut['grade'] = 'Undefined'
df_cut

     Name  Score      grade
0  Marcus     90  Undefined
1    Leia     95  Undefined
2   Oscar     55  Undefined
3     Dan     62  Undefined
4    Judy     75  Undefined
5     Tom     98  Undefined
6   Emily     81  Undefined

In [8]:
# Recours aux conditions if...
for i, row in df_cut.iterrows():
    if row['Score'] >= 90:
        df_cut.loc[i, 'grade'] = 'A'
    elif row['Score'] >= 80:
        df_cut.loc[i, 'grade'] = 'B'
    elif row['Score'] >= 70:
        df_cut.loc[i, 'grade'] = 'C'
    elif row['Score'] >= 60:
        df_cut.loc[i, 'grade'] = 'D'
    else:
        df_cut.loc[i, 'grade'] = 'E'

df_cut

     Name  Score grade
0  Marcus     90     A
1    Leia     95     A
2   Oscar     55     E
3     Dan     62     D
4    Judy     75     C
5     Tom     98     A
6   Emily     81     B

2ème solution : recourir à la fonction 'cut'

In [12]:
# Valeurs recherchée assignées dans une liste
bins = [0, 60, 70, 80, 90, 100]

In [13]:
# Valeurs attribuées assigénes dans une liste, 
# aux valeurs recherchées dans la liste ci-avant
labels = ['E', 'D', 'C', 'B', 'A']

In [16]:
# Recours à la fonction cut
df_cut['grade'] = pd.cut(
    df_cut['Score'], # Colonne ciblée
    bins=bins, # Valeurs recherchées dans la colonne 'score'
    labels=labels, # Valeurs attribuées dans la nouvelle colonne 'grade'
    right=False,
)
df_cut

     Name  Score grade
0  Marcus     90     A
1    Leia     95     A
2   Oscar     55     E
3     Dan     62     D
4    Judy     75     C
5     Tom     98     A
6   Emily     81     B